/*----------------------------------------------------------------

	简介：Sprite类接口
	文件：Sprite.h
	版权所有：2003-	王延樑

	当前版本：0.1
	作者：王延樑
	时间：2004-07-15 21:17

----------------------------------------------------------------*/
#ifndef _AE_OGL_EXTENTION_H_
#define _AE_OGL_EXTENTION_H_ "OGLExtension.h"
//----------------------------------------------------------------
#include <windows.h>
#include <gl/gl.h>
#include <gl/glext.h>
#include <gl/wglext.h>
//----------------------------------------------------------------
//	名称：InitOGLExtension
//	简介：初始化OGL扩展函数指针
//	参数：无
//	返回：无
//----------------------------------------------------------------
void InitOGLExtension(void);
//----------------------------------------------------------------
#endif//_AE_OGL_EXTENTION_H_
