/////////////////////////////////////////////////////////////////////////
// 名称: CGetS3DFileInfo--S3D文件读取类
// 描述: 读取S3D文件，并规整场景数据
// 作者: lixin	
// 日期: 2005-12-23
////////////////////////////////////////////////////////////////////////

#include "CGetS3DFileInfo.h"

//##ModelId=47EBC74C0294
CGetS3DFileInfo::CGetS3DFileInfo()
{
}

//##ModelId=47EBC74C02AF
CGetS3DFileInfo::~CGetS3DFileInfo()
{
	
}

//-----------------------------------------------------------------
//方法名：ReadFileHeader()
//参数：
//用途：读文件头
//-----------------------------------------------------------------
//##ModelId=47EBC74C012D
VOID CGetS3DFileInfo::ReadFileHeader()
{
}

//-----------------------------------------------------------------
//方法名：ReadSceneTable()
//参  数：
//用  途：读场景信息表
//-----------------------------------------------------------------
//##ModelId=47EBC74C0148
VOID CGetS3DFileInfo::ReadSceneTable()
{
}

//-----------------------------------------------------------------
//方法名：ReadSceneGCS()
//参  数：
//用  途：读场景坐标系
//-----------------------------------------------------------------
//##ModelId=47EBC74C0167
VOID CGetS3DFileInfo::ReadSceneGCS()
{

}

//-----------------------------------------------------------------
//方法名：ReadTextureInfo()
//参  数：
//用  途：读贴图信息
//-----------------------------------------------------------------
//##ModelId=47EBC74C0186
VOID CGetS3DFileInfo::ReadTextureInfo()
{

}

//-----------------------------------------------------------------
//方法名：GetS3DFileInfo::ReadMaterialInfo()
//参  数：
//用  途：读材质信息
//-----------------------------------------------------------------
//##ModelId=47EBC74C0196
VOID CGetS3DFileInfo::ReadMaterialInfo()
{
}

//-----------------------------------------------------------------
//方法名：GetS3DFileInfo::ReadVerticesInfo()
//参  数：
//用  途：读顶点信息
//-----------------------------------------------------------------
//##ModelId=47EBC74C01D4
VOID CGetS3DFileInfo::ReadVerticesInfo()
{
}

//-----------------------------------------------------------------
//方法名：GetS3DFileInfo::ReadFaceInfo()
//参  数：
//用  途：读面信息
//-----------------------------------------------------------------
//##ModelId=47EBC74C01C5
VOID CGetS3DFileInfo::ReadFaceInfo()
{
}

//-----------------------------------------------------------------
//方法名：GetS3DFileInfo::ReadCameraInfo()
//参  数：
//用  途：读摄像机信息
//-----------------------------------------------------------------
//##ModelId=47EBC74C0203
VOID CGetS3DFileInfo::ReadCameraInfo()
{
}

//-----------------------------------------------------------------
//方法名：GetS3DFileInfo::ReadUintInfo()
//参  数：
//用  途：读模型信息
//-----------------------------------------------------------------
//##ModelId=47EBC74C01B5
VOID CGetS3DFileInfo::ReadUnitInfo()
{
}

//-----------------------------------------------------------------
//方法名：GetS3DFileInfo::ReadUnitKeyFrameInfo()
//参  数：
//用  途：读模型关键帧动画信息
//-----------------------------------------------------------------
//##ModelId=47EBC74C01F4
VOID CGetS3DFileInfo::ReadUnitKeyFrameInfo()
{

}

//-------------------------------------------------------------------
//方法名: ReadLightInfo()
//参  数: 
//用  途: 读取灯光信息
//-------------------------------------------------------------------
//##ModelId=47EBC74C0213
VOID CGetS3DFileInfo::ReadLightInfo()
{

}

//-------------------------------------------------------------------
//方法名：LoadS3DFile()
//参  数：CHAR* strFileName--S3D文件名
//用  途：打开S3D文件
//-------------------------------------------------------------------
//##ModelId=47EBC74C0280
HRESULT	CGetS3DFileInfo::LoadS3DFile(CHAR* strFileName)
{
	

	return S_OK;
}

//-------------------------------------------------------------------
//方法名：LoadS3DFile()
//参  数：CScene* pScene, CHAR* FileName--S3D文件名
//bImportModel 是否导入模型
//bImportLight 是否导入灯光
//bImportCamera 是否导入相机
//用  途：打开指定的S3D文件，并导入到指定的场景
//-------------------------------------------------------------------
//##ModelId=47EBC74C0263
HRESULT CGetS3DFileInfo::LoadS3DFile(CScene* theScene, CHAR* strFileName, 
									 BOOL bImportModel, 
									 BOOL bImportLight, 
									 BOOL bImportCamera)
{


	return S_OK;
	
}

//-------------------------------------------------------------------
//方法名: CalculateNormal()
//参  数: 
//用  途: 得到面的法线，因为模型的变换关系，所以在这里计算三角面的法线是不可行的
//-------------------------------------------------------------------
//##ModelId=47EBC74C0222
VOID CGetS3DFileInfo::CalculateNormal(CModel* pModel, CFace* pFace)
{
}

//-----------------------------------------------------------------------------
// 方法名: ReadTextureData()
// 参  数: 
// 描  述: 读取贴图信息，并将贴图信息填入texture链表
//-----------------------------------------------------------------------------
//##ModelId=47EBC74C0243
VOID CGetS3DFileInfo::ReadTextureData()
{
}


//-----------------------------------------------------------------------------
// 方法名: ReadMtrlData()
// 参  数: 
// 描  述: 读取材质的信息,并将材质信息填入m_Mtrls链表
//-----------------------------------------------------------------------------
//##ModelId=47EBC74C0244
VOID CGetS3DFileInfo::ReadMtrlData()
{
	
}

//-----------------------------------------------------------------------------
// 方法名: ReadCameraData()
// 参  数: 
// 描  述: 读入摄像机数据，把摄像机数据存入camera链表
//-----------------------------------------------------------------------------
//##ModelId=47EBC74C0251
VOID CGetS3DFileInfo::ReadCameraData()
{
}

//-----------------------------------------------------------------------------
// 方法名: ReadLightData()
// 参  数: 
// 描  述: 读入灯光数据, 将读入的数据填入light链表
//-----------------------------------------------------------------------------
//##ModelId=47EBC74C0253
VOID CGetS3DFileInfo::ReadLightData()
{
}

//-----------------------------------------------------------------------------
// 方法名: ReadModelData()
// 参  数: 
// 描  述: 读入模型数据, 将读入的数据填入model链表
//-----------------------------------------------------------------------------
//##ModelId=47EBC74C0252
VOID CGetS3DFileInfo::ReadModelData()
{
}

//-----------------------------------------------------------------------------
// 方法名: GetDUnitIndex()
// 参  数: UINT unitIndex
// 描  述: 找到当前编号模型对应的动态模型编号
//-----------------------------------------------------------------------------
//##ModelId=47EBC74C0261
INT CGetS3DFileInfo::GetDUnitIndex(UINT unitIndex)
{
	return 0;
}

//-------------------------------------------------------------------
//名  称: GetS3DFileInfo::Release()
//用  途: 清空对象内存
//-------------------------------------------------------------------
//##ModelId=47EBC74C0293
VOID CGetS3DFileInfo::Release()
{
}

//---------------------------------------------------------------------
//用于贴图到库的拷贝
//##ModelId=47EBC74C0290
UINT CGetS3DFileInfo::GetTextureCount()
{
	return TextureCnt;
}

//##ModelId=47EBC74C0291
CHAR* CGetS3DFileInfo::GetTextureName(UINT index)
{
	return (TexNameList[index]).Name;
}
