//--------------------------------------------------------------
//	名称:Sun3D360.cpp
//	简介:Sun3D360 dll实现文件
//	创建:姚有方
//	日期:05-4-29
//	版本:0.1V
//--------------------------------------------------------------
#include "stdafx.h"
//--------------------------------------------------------------
#include "../Common/Sun3D360.h"
#include "Sun3D.h"
//--------------------------------------------------------------
//	名称:DllMain
//	简介:Sun3D360 dll 入口
//--------------------------------------------------------------
BOOL APIENTRY DllMain( HANDLE hModule, 
                       DWORD  ul_reason_for_call, 
                       LPVOID lpReserved
					 )
{
    switch (ul_reason_for_call)
	{
		case DLL_PROCESS_ATTACH:
		case DLL_THREAD_ATTACH:
		case DLL_THREAD_DETACH:
		case DLL_PROCESS_DETACH:
			break;
    }
    return TRUE;
}
//--------------------------------------------------------------
//	名称:Sun3D360_Create
//	简介:构造函数，应用程序先调用该函数得到一个CSun3D360指针，然后才能调用其接口
//	参数:无
//	返回:返回新创建的CSun3D360对象指针
//--------------------------------------------------------------
SUN3D360_API CSun3D360* Sun3D360_Create()
{
	CSun3D* pSun3D = new CSun3D();
	return pSun3D;
}
//--------------------------------------------------------------
//	名称:Sun3D360_Destroy
//	简介:销毁函数，应用程序在退出的时候调用该函数来销毁CSun3D360对象
//	参数:pSun3D360:i:要销毁的CSun3D360对象指针
//	返回:无
//--------------------------------------------------------------
SUN3D360_API void Sun3D360_Destroy(CSun3D360* pSun3D360)
{
	if(pSun3D360) 
	{
		pSun3D360->S3D360_Destroy();
		pSun3D360 = NULL;
	}
}
//--------------------------------------------------------------

