/////////////////////////////////////////////////////////////////////////
// 名称: CInput.cpp--CInput class
// 描述: 输入设备的处理类，包含鼠标键盘，游戏操作杆
// 作者: lixin	
// 日期: 2006-05-24
////////////////////////////////////////////////////////////////////////
#include "stdafx.h"
#include "CInput.h"

//////////////////////////////////////////////////////////////////////
// Construction/Destruction
//////////////////////////////////////////////////////////////////////

CInput::CInput()
{
	ZeroMemory(keyBoardBuf, sizeof(keyBoardBuf));
	
	mouseInfo.X = 0;
	mouseInfo.Y = 0;				//坐标
	mouseInfo.LButton = FALSE;		//按下为1，松开为0
	mouseInfo.RButton = FALSE;
	mouseInfo.RollDis = 0.0f;		//滚轮
}

CInput::~CInput()
{

}

//-------------------------------------------------------------------
//方法: Release()
//参数: 
//用途: 释放所有资源
//-------------------------------------------------------------------
VOID CInput::Release()
{

}